KittenBot/micropython_meowbit/ports/stm32/main.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2013-2018 Damien P. George
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <stdio.h>
#include <string.h>

#include "py/runtime.h"
#include "py/stackctrl.h"
#include "py/gc.h"
#include "py/mphal.h"
#include "lib/mp-readline/readline.h"
#include "lib/utils/pyexec.h"
#include "lib/oofatfs/ff.h"
#include "lwip/init.h"
#include "extmod/vfs.h"
#include "extmod/vfs_fat.h"

#include "systick.h"
#include "pendsv.h"
#include "pybthread.h"
#include "gccollect.h"
#include "modmachine.h"
#include "i2c.h"
#include "spi.h"
#include "uart.h"
#include "timer.h"
#include "led.h"
#include "pin.h"
#include "extint.h"
#include "usrsw.h"
#include "usb.h"
#include "rtc.h"
#include "storage.h"
#include "sdcard.h"
#include "sdram.h"
#include "rng.h"
#include "accel.h"
#include "servo.h"
#include "dac.h"
#include "can.h"
#include "modnetwork.h"

void SystemClock_Config(void);

pyb_thread_t pyb_thread_main;
fs_user_mount_t fs_user_mount_flash;

void flash_error(int n) {
    for (int i = 0; i < n; i++) {
        led_state(PYB_LED_RED, 1);
        led_state(PYB_LED_GREEN, 0);
        mp_hal_delay_ms(250);
        led_state(PYB_LED_RED, 0);
        led_state(PYB_LED_GREEN, 1);
        mp_hal_delay_ms(250);
    }
    led_state(PYB_LED_GREEN, 0);
}

void NORETURN __fatal_error(const char *msg) {
    for (volatile uint delay = 0; delay < 10000000; delay++) {
    }
    led_state(1, 1);
    led_state(2, 1);
    led_state(3, 1);
    led_state(4, 1);
    mp_hal_stdout_tx_strn("\nFATAL ERROR:\n", 14);
    mp_hal_stdout_tx_strn(msg, strlen(msg));
    for (uint i = 0;;) {
        led_toggle(((i++) & 3) + 1);
        for (volatile uint delay = 0; delay < 10000000; delay++) {
        }
        if (i >= 16) {
            // to conserve power
            __WFI();
        }
    }
}

void nlr_jump_fail(void *val) {
    printf("FATAL: uncaught exception %p\n", val);
    mp_obj_print_exception(&mp_plat_print, MP_OBJ_FROM_PTR(val));
    __fatal_error("");
}

#ifndef NDEBUG
void MP_WEAK __assert_func(const char *file, int line, const char *func, const char *expr) {
    (void)func;
    printf("Assertion '%s' failed, at file %s:%d\n", expr, file, line);
    __fatal_error("");
}
#endif

STATIC mp_obj_t pyb_main(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_opt, MP_ARG_INT, {.u_int = 0} }
    };

    if (MP_OBJ_IS_STR(pos_args[0])) {
        MP_STATE_PORT(pyb_config_main) = pos_args[0];

        // parse args
        mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
        mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);
        MP_STATE_VM(mp_optimise_value) = args[0].u_int;
    }
    return mp_const_none;
}
MP_DEFINE_CONST_FUN_OBJ_KW(pyb_main_obj, 1, pyb_main);

#if MICROPY_HW_ENABLE_STORAGE
static const char fresh_boot_py[] =
"# boot.py -- run on boot-up\r\n"
"# can run arbitrary Python, but best to keep it minimal\r\n"
"\r\n"
"import machine\r\n"
"import pyb\r\n"
"#pyb.main('main.py') # main script to run after this one\r\n"
#if MICROPY_HW_ENABLE_USB
"#pyb.usb_mode('VCP+MSC') # act as a serial and a storage device\r\n"
"#pyb.usb_mode('VCP+HID') # act as a serial device and a mouse\r\n"
#endif
;

static const char fresh_main_py[] =
"# main.py -- put your code here!\r\n"
"import pyb\r\n"
"import framebuf\r\n"
"fbuf = bytearray(160*128)\r\n"
"fb = framebuf.FrameBuffer(fbuf, 160, 128, framebuf.PL8)\r\n"
"tft = pyb.SCREEN()\r\n"
"fb.fill(8)\r\n"
"fb.text('Hello Micropython!', 10, 50, 2)\r\n"
"tft.show(fb, 1)\r\n"
;

static const char fresh_buzz_py[] =
"from pyb import Pin, Timer, delay\r\n"
"\r\n"
"Do = 261\r\n"
"Re = 294\r\n"
"Mi = 329\r\n"
"Fa = 349\r\n"
"So = 392\r\n"
"Ra = 440\r\n"
"Xi = 494\r\n"
"\r\n"
"buzz = Pin('BUZZ')\r\n"
"tim = Timer(4, freq=3000)\r\n"
"ch = tim.channel(3, Timer.PWM, pin=buzz)\r\n"
"noteMap = [440, 494, 262, 294, 330, 349, 392]\r\n"
"\r\n"
"def tone(freq, d=1000):\r\n"
"    if freq == 0:\r\n"
"        delay(d)\r\n"
"        return\r\n"
"    tim.freq(freq)\r\n"
"    ch.pulse_width_percent(30)\r\n"
"    delay(d)\r\n"
"    ch.pulse_width_percent(0)\r\n"
"\r\n"
"def music(m):\r\n"
"    m = m.lower()\r\n"
"    octave = 4\r\n"
"    duration = 500\r\n"
"    n = 0\r\n"
"    while n < len(m):\r\n"
"        note = ord(m[n])\r\n"
"        if note >= ord('a') and note <= ord('g'):\r\n"
"            freq = noteMap[note-ord('a')]\r\n"
"        elif note == ord('r'):\r\n"
"            freq = 0\r\n"
"        elif note >= ord('2') and note <= ord('6'):\r\n"
"            octave = note - ord('0')\r\n"
"        elif note == ord(':'):\r\n"
"            n+=1\r\n"
"            note = ord(m[n])\r\n"
"            duration = (note - ord('0'))*125\r\n"
"        elif note == ord(' '):\r\n"
"            freq *= pow(2, octave-4)\r\n"
"            tone(freq, duration)\r\n"
"        n+=1\r\n"
;

static const char fresh_mpu6050_py[] =
"class accel():\r\n"
"    def __init__(self, i2c, addr=0x68):\r\n"
"        self.iic = i2c\r\n"
"        self.addr = addr\r\n"
"        self.iic.init()\r\n"
"        self.iic.send(bytearray([107, 0]), self.addr)\r\n"
"    def get_raw_values(self):\r\n"
"        a = self.iic.mem_read(14, self.addr, 0x3B)\r\n"
"        return a\r\n"
"    def get_ints(self):\r\n"
"        b = self.get_raw_values()\r\n"
"        c = []\r\n"
"        for i in b:\r\n"
"            c.append(i)\r\n"
"        return c\r\n"
"    def bytes_toint(self, firstbyte, secondbyte):\r\n"
"        if not firstbyte & 0x80:\r\n"
"            return firstbyte << 8 | secondbyte\r\n"
"        return - (((firstbyte ^ 255) << 8) | (secondbyte ^ 255) + 1)\r\n"
"    def get_ac_y(self):                  # 单独读取x轴加速度值\r\n"
"        raw_ints = self.get_raw_values() \r\n"
"        ac_x = 0\r\n"
"        ac_x = self.bytes_toint(raw_ints[0], raw_ints[1])\r\n"
"        return ac_x\r\n"
"    def get_ac_x(self):\r\n"
"        raw_ints = self.get_raw_values() \r\n"
"        ac_y = 0\r\n"
"        ac_y = self.bytes_toint(raw_ints[2], raw_ints[3])\r\n"
"        return ac_y\r\n"
"    def get_ac_z(self):\r\n"
"        raw_ints = self.get_raw_values() \r\n"
"        ac_z = 0\r\n"
"        ac_z = self.bytes_toint(raw_ints[4], raw_ints[5])\r\n"
"        return ac_z\r\n"
"    def get_g_y(self):                        # 单独读取重力加速度值\r\n"
"        raw_ints = self.get_raw_values() \r\n"
"        g_x = 0\r\n"
"        g_x = self.bytes_toint(raw_ints[8], raw_ints[9])\r\n"
"        return g_x\r\n"
"    def get_g_x(self):\r\n"
"        raw_ints = self.get_raw_values() \r\n"
"        g_y = 0\r\n"
"        g_y = self.bytes_toint(raw_ints[10], raw_ints[11])\r\n"
"        return g_y\r\n"
"    def get_g_z(self):\r\n"
"        raw_ints = self.get_raw_values() \r\n"
"        g_z = 0\r\n"
"        g_z = self.bytes_toint(raw_ints[12], raw_ints[13])\r\n"
"        return g_z\r\n"
"    def get_values(self):                    # 同时读取\r\n"
"        raw_ints = self.get_raw_values()\r\n"
"        vals = {}\r\n"
"        vals['AcY'] = self.bytes_toint(raw_ints[0], raw_ints[1])\r\n"
"        vals['AcX'] = self.bytes_toint(raw_ints[2], raw_ints[3])\r\n"
"        vals['AcZ'] = self.bytes_toint(raw_ints[4], raw_ints[5])\r\n"
"        vals['Tmp'] = self.bytes_toint(raw_ints[6], raw_ints[7]) / 340.00 + 36.53\r\n"
"        vals['GyY'] = self.bytes_toint(raw_ints[8], raw_ints[9])\r\n"
"        vals['GyX'] = self.bytes_toint(raw_ints[10], raw_ints[11])\r\n"
"        vals['GyZ'] = self.bytes_toint(raw_ints[12], raw_ints[13])\r\n"
"        return vals  # returned in range of Int16\r\n"
"        # -32768 to 32767\r\n"
"    # 同时读取持续打印数据用于测试\r\n"
"    def val_test(self):  # ONLY FOR TESTING! Also, fast reading sometimes crashes IIC\r\n"
"        from time import sleep\r\n"
"        while 1:\r\n"
"            print(self.get_values())\r\n"
"            sleep(0.2)"
;


static const char fresh_pybcdc_inf[] =
#include "genhdr/pybcdc_inf.h"
;

